Autodesk.Revit.DB.SaveModifiedLinksOptionsForUnloadLocally
Class giving options when saving linked files which are unloaded locally and have been modified
in-memory by shared coordinates operations.
Since:
2017
Since:
2017

Autodesk.Revit.DB.SaveModifiedLinksOptionsForUnloadLocally.DoNotSaveLinks
Any modified linked files will not be saved. The links will return to their previous
position the next time the file is loaded.

Autodesk.Revit.DB.SaveModifiedLinksOptionsForUnloadLocally.SaveLinks
Any modified linked files will be saved.